In [3]:
# 1.导包
import random
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import os
# 改变工作目录
os.chdir(r"E:\ProjectCode\PythonProjectCode\pythonProject\HaskMaProject")
# 解决折线图中中文显示问题
plt.rcParams['font.sans-serif'] = ['SimHei']
plt.rcParams['axes.unicode_minus'] = False

# 《movie.csv》

In [119]:
# 读取文件
df = pd.read_csv(r"./data/movie.csv")
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Rank                1000 non-null   int64
 1   Title               1000 non-null   object
 2   Genre               1000 non-null   object
 3   Description         1000 non-null   object
 4   Director            1000 non-null   object
 5   Actors              1000 non-null   object
 6   Year                1000 non-null   int64
 7   Runtime (Minutes)   1000 non-null   int64
 8   Rating              1000 non-null   float64
 9   Votes               1000 non-null   int64
 10  Revenue (Millions)  872 non-null    float64
 11  Metascore           936 non-null    float64
dtypes: float64(3), int64(4), object(5)
memory usage: 93.9+ KB

In [8]:
# 1.读取文件，筛选出评分大于 8 且时长超过 120 分钟的电影，按评分降序排序后保存为新的 CSV 文件。
# df[df['Rating'] > 8]
# df[df['Runtime (Minutes)'] > 120]
df[(df['Rating'] > 8) & (df['Runtime (Minutes)'] > 120)].sort_values(by='Rating',ascending=False)
# 按评分降序排序 sort_values

,Rank,Title,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
54,55,The Dark Knight,"Action,Crime,Drama",When the menace known as the Joker wreaks havo...,Christopher Nolan,"Christian Bale, Heath Ledger, Aaron Eckhart,Mi...",2008,152,9.0,1791916,533.32,82.0
80,81,Inception,"Action,Adventure,Sci-Fi","A thief, who steals corporate secrets through ...",Christopher Nolan,"Leonardo DiCaprio, Joseph Gordon-Levitt, Ellen...",2010,148,8.8,1583625,292.57,74.0
117,118,Dangal,"Action,Biography,Drama",Former wrestler Mahavir Singh Phogat and his t...,Nitesh Tiwari,"Aamir Khan, Sakshi Tanwar, Fatima Sana Shaikh,...",2016,161,8.8,48969,11.15,NaN
36,37,Interstellar,"Adventure,Drama,Sci-Fi",A team of explorers travel through a wormhole ...,Christopher Nolan,"Matthew McConaughey, Anne Hathaway, Jessica Ch...",2014,169,8.6,1047747,187.99,74.0
124,125,The Dark Knight Rises,"Action,Thriller",Eight years after the Joker's reign of anarchy...,Christopher Nolan,"Christian Bale, Tom Hardy, Anne Hathaway,Gary ...",2012,164,8.5,1222645,448.13,78.0
476,477,The Lives of Others,"Drama,Thriller","In 1984 East Berlin, an agent of the secret po...",Florian Henckel von Donnersmarck,"Ulrich Mühe, Martina Gedeck,Sebastian Koch, Ul...",2006,137,8.5,278103,11.28,89.0
99,100,The Departed,"Crime,Drama,Thriller",An undercover cop and a mole in the police att...,Martin Scorsese,"Leonardo DiCaprio, Matt Damon, Jack Nicholson,...",2006,151,8.5,937414,132.37,85.0
991,992,Taare Zameen Par,"Drama,Family,Music",An eight-year-old boy is thought to be a lazy ...,Aamir Khan,"Darsheel Safary, Aamir Khan, Tanay Chheda, Sac...",2007,165,8.5,102697,1.20,42.0
64,65,The Prestige,"Drama,Mystery,Sci-Fi",Two stage magicians engage in competitive one-...,Christopher Nolan,"Christian Bale, Hugh Jackman, Scarlett Johanss...",2006,130,8.5,913152,53.08,66.0
144,145,Django Unchained,"Drama,Western","With the help of a German bounty hunter , a fr...",Quentin Tarantino,"Jamie Foxx, Christoph Waltz, Leonardo DiCaprio...",2012,165,8.4,1039115,162.80,81.0
861,862,Koe no katachi,"Animation,Drama,Romance","The story revolves around Nishimiya Shoko, a g...",Naoko Yamada,"Miyu Irino, Saori Hayami, Aoi Yuki, Kenshô Ono",2016,129,8.4,2421,NaN,80.0
430,431,3 Idiots,"Comedy,Drama",Two friends are searching for their long lost ...,Rajkumar Hirani,"Aamir Khan, Madhavan, Mona Singh, Sharman Joshi",2009,170,8.4,238789,6.52,67.0
77,78,Inglourious Basterds,"Adventure,Drama,War","In Nazi-occupied France during World War II, a...",Quentin Tarantino,"Brad Pitt, Diane Kruger, Eli Roth,Mélanie Laurent",2009,153,8.3,959065,120.52,69.0
26,27,Bahubali: The Beginning,"Action,Adventure,Drama","In ancient India, an adventurous and daring ma...",S.S. Rajamouli,"Prabhas, Rana Daggubati, Anushka Shetty,Tamann...",2015,159,8.3,76193,6.50,NaN
6,7,La La Land,"Comedy,Drama,Music",A jazz pianist falls for an aspiring actress i...,Damien Chazelle,"Ryan Gosling, Emma Stone, Rosemarie DeWitt, J....",2016,128,8.3,258682,151.06,93.0
194,195,Warrior,"Action,Drama,Sport",The youngest son of an alcoholic former boxer ...,Gavin O'Connor,"Tom Hardy, Nick Nolte, Joel Edgerton, Jennifer...",2011,140,8.2,355722,13.65,71.0
82,83,The Wolf of Wall Street,"Biography,Comedy,Crime","Based on the true story of Jordan Belfort, fro...",Martin Scorsese,"Leonardo DiCaprio, Jonah Hill, Margot Robbie,M...",2013,180,8.2,865134,116.87,75.0
765,766,PK,"Comedy,Drama,Romance",A stranger in the city asks questions no one h...,Rajkumar Hirani,"Aamir Khan, Anushka Sharma, Sanjay Dutt,Boman ...",2014,153,8.2,103279,10.57,51.0
742,743,El secreto de sus ojos,"Drama,Mystery,Romance",A retired legal counselor writes a novel hopin...,Juan José Campanella,"Ricardo Darín, Soledad Villamil, Pablo Rago,Ca...",2009,129,8.2,144524,20.17,80.0
713,714,Incendies,"Drama,Mystery,War",Twins journey to the Middle East to discover t...,Denis Villeneuve,"Lubna Azabal, Mélissa Désormeaux-Poulin, Maxim...",2010,131,8.2,92863,6.86,80.0
16,17,Hacksaw Ridge,"Biography,Drama,History","WWII American Army Medic Desmond T. Doss, who ...",Mel Gibson,"Andrew Garfield, Sam Worthington, Luke Bracey,...",2016,139,8.2,211760,67.12,71.0
334,335,Rush,"Action,Biography,Drama",The merciless 1970s rivalry between Formula On...,Ron Howard,"Daniel Brühl, Chris Hemsworth, Olivia Wilde,Al...",2013,123,8.1,339722,26.90,75.0
76,77,The Avengers,"Action,Sci-Fi",Earth's mightiest heroes must come together an...,Joss Whedon,"Robert Downey Jr., Chris Evans, Scarlett Johan...",2012,143,8.1,1045588,623.28,69.0
299,300,There Will Be Blood,"Drama,History","A story of family, religion, hatred, oil and m...",Paul Thomas Anderson,"Daniel Day-Lewis, Paul Dano, Ciarán Hinds,Mart...",2007,158,8.1,400682,40.22,92.0
641,642,Relatos salvajes,"Comedy,Drama,Thriller",Six short stories that explore the extremities...,Damián Szifron,"Darío Grandinetti, María Marull, Mónica Villa,...",2014,122,8.1,110100,3.08,77.0
608,609,Mommy,Drama,"A widowed single mother, raising her violent s...",Xavier Dolan,"Anne Dorval, Antoine-Olivier Pilon, Suzanne Cl...",2014,139,8.1,33560,3.49,74.0
145,146,Ah-ga-ssi,"Drama,Mystery,Romance",A woman is hired as a handmaiden to a Japanese...,Chan-wook Park,"Min-hee Kim, Jung-woo Ha, Jin-woong Jo, So-ri ...",2016,144,8.1,33418,2.01,84.0
197,198,Into the Wild,"Adventure,Biography,Drama","After graduating from Emory University, top st...",Sean Penn,"Emile Hirsch, Vince Vaughn, Catherine Keener, ...",2007,148,8.1,459304,18.35,73.0
192,193,Spotlight,"Crime,Drama,History",The true story of how the Boston Globe uncover...,Tom McCarthy,"Mark Ruffalo, Michael Keaton, Rachel McAdams, ...",2015,128,8.1,268282,44.99,93.0
138,139,Shutter Island,"Mystery,Thriller","In 1954, a U.S. marshal investigates the disap...",Martin Scorsese,"Leonardo DiCaprio, Emily Mortimer, Mark Ruffal...",2010,138,8.1,855604,127.97,63.0
136,137,No Country for Old Men,"Crime,Drama,Thriller",Violence and mayhem ensue after a hunter stumb...,Ethan Coen,"Tommy Lee Jones, Javier Bardem, Josh Brolin, W...",2007,122,8.1,660286,74.27,91.0
114,115,Harry Potter and the Deathly Hallows: Part 2,"Adventure,Drama,Fantasy","Harry, Ron and Hermione search for Voldemort's...",David Yates,"Daniel Radcliffe, Emma Watson, Rupert Grint, M...",2011,130,8.1,590595,380.96,87.0
111,112,12 Years a Slave,"Biography,Drama,History","In the antebellum United States, Solomon North...",Steve McQueen,"Chiwetel Ejiofor, Michael Kenneth Williams, Mi...",2013,134,8.1,486338,56.67,96.0
50,51,Star Wars: Episode VII - The Force Awakens,"Action,Adventure,Fantasy",Three decades after the defeat of the Galactic...,J.J. Abrams,"Daisy Ridley, John Boyega, Oscar Isaac, Domhna...",2015,136,8.1,661608,936.63,81.0
92,93,The Help,Drama,An aspiring author during the civil rights mov...,Tate Taylor,"Emma Stone, Viola Davis, Octavia Spencer, Bryc...",2011,146,8.1,342429,169.71,62.0
90,91,Prisoners,"Crime,Drama,Mystery",When Keller Dover's daughter and her friend go...,Denis Villeneuve,"Hugh Jackman, Jake Gyllenhaal, Viola Davis,Mel...",2013,153,8.1,431185,60.96,74.0
83,84,Gone Girl,"Crime,Drama,Mystery",With his wife's disappearance having become th...,David Fincher,"Ben Affleck, Rosamund Pike, Neil Patrick Harri...",2014,149,8.1,636243,167.74,79.0
0,1,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,757074,333.13,76.0

In [15]:
# 2.按电影类型分组，过滤出电影数量少于 50 部的类型，展示这些类型的名称和电影数量。
g_df = df.groupby('Genre').size().reset_index(name='电影数量')
df2 = g_df[g_df['电影数量']<50]
df2

                          Genre  电影数量
0                        Action     2
1              Action,Adventure     3
2    Action,Adventure,Biography     2
3       Action,Adventure,Comedy    14
4        Action,Adventure,Crime     6
..                          ...   ...
202     Romance,Sci-Fi,Thriller     1
203                      Sci-Fi     2
204             Sci-Fi,Thriller     1
205                    Thriller     9
206                Thriller,War     1

[206 rows x 2 columns]

In [16]:
# 3.找出每年票房最高的电影及其票房金额，将结果保存为新的 DataFrame。
# 方法一：
df.sort_values(by=['Year', 'Revenue (Millions)'], ascending=[True, False]).groupby('Year').head(1)
# 方法二：
df3 = df.groupby('Year').agg({
    'Revenue (Millions)': 'max'
})
df3_1 = pd.merge(df3, df, on=['Revenue (Millions)', 'Year'])[['Title', 'Year', 'Revenue (Millions)']]
# 方法三
df3_1 = pd.merge(df3, df, on=['Revenue (Millions)', 'Year'])[['Title', 'Year', 'Revenue (Millions)']]

,Rank,Title,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
78,79,Pirates of the Caribbean: Dead Man's Chest,"Action,Adventure,Fantasy",Jack Sparrow races to recover the heart of Dav...,Gore Verbinski,"Johnny Depp, Orlando Bloom, Keira Knightley, J...",2006,151,7.3,552027,423.03,53.0
344,345,Spider-Man 3,"Action,Adventure",A strange black entity from another world bond...,Sam Raimi,"Tobey Maguire, Kirsten Dunst, Topher Grace, Th...",2007,139,6.2,406219,336.53,59.0
54,55,The Dark Knight,"Action,Crime,Drama",When the menace known as the Joker wreaks havo...,Christopher Nolan,"Christian Bale, Heath Ledger, Aaron Eckhart,Mi...",2008,152,9.0,1791916,533.32,82.0
87,88,Avatar,"Action,Adventure,Fantasy",A paraplegic marine dispatched to the moon Pan...,James Cameron,"Sam Worthington, Zoe Saldana, Sigourney Weaver...",2009,162,7.8,935408,760.51,83.0
688,689,Toy Story 3,"Animation,Adventure,Comedy",The toys are mistakenly delivered to a day-car...,Lee Unkrich,"Tom Hanks, Tim Allen, Joan Cusack, Ned Beatty",2010,103,8.3,586669,414.98,92.0
114,115,Harry Potter and the Deathly Hallows: Part 2,"Adventure,Drama,Fantasy","Harry, Ron and Hermione search for Voldemort's...",David Yates,"Daniel Radcliffe, Emma Watson, Rupert Grint, M...",2011,130,8.1,590595,380.96,87.0
76,77,The Avengers,"Action,Sci-Fi",Earth's mightiest heroes must come together an...,Joss Whedon,"Robert Downey Jr., Chris Evans, Scarlett Johan...",2012,143,8.1,1045588,623.28,69.0
578,579,The Hunger Games: Catching Fire,"Action,Adventure,Mystery",Katniss Everdeen and Peeta Mellark become targ...,Francis Lawrence,"Jennifer Lawrence, Josh Hutcherson, Liam Hemsw...",2013,146,7.6,525646,424.65,76.0
331,332,American Sniper,"Action,Biography,Drama",Navy S.E.A.L. sniper Chris Kyle's pinpoint acc...,Clint Eastwood,"Bradley Cooper, Sienna Miller, Kyle Gallner, C...",2014,133,7.3,353305,350.12,72.0
50,51,Star Wars: Episode VII - The Force Awakens,"Action,Adventure,Fantasy",Three decades after the defeat of the Galactic...,J.J. Abrams,"Daisy Ridley, John Boyega, Oscar Isaac, Domhna...",2015,136,8.1,661608,936.63,81.0
12,13,Rogue One,"Action,Adventure,Sci-Fi",The Rebel Alliance makes a risky move to steal...,Gareth Edwards,"Felicity Jones, Diego Luna, Alan Tudyk, Donnie...",2016,133,7.9,323118,532.17,65.0

In [17]:
# 4.计算每种电影类型的评分标准差，按标准差从大到小排序，取前 3 种类型。
g_df = df.groupby('Genre')['Rating'].std().reset_index(name='评分标准差')
df4 = g_df.sort_values(by='评分标准差',ascending=False).head(3)
df4

                      Genre     评分标准差
50   Action,Horror,Thriller  2.095233
0                    Action  1.767767
125   Comedy,Fantasy,Horror  1.656301

In [134]:
df

,Rank,Title,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
0,1,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,757074,333.13,76.0
1,2,Prometheus,"Adventure,Mystery,Sci-Fi","Following clues to the origin of mankind, a te...",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael Fa...",2012,124,7.0,485820,126.46,65.0
2,3,Split,"Horror,Thriller",Three girls are kidnapped by a man with a diag...,M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,157606,138.12,62.0
3,4,Sing,"Animation,Comedy,Family","In a city of humanoid animals, a hustling thea...",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,60545,270.32,59.0
4,5,Suicide Squad,"Action,Adventure,Fantasy",A secret government agency recruits some of th...,David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,393727,325.02,40.0
...,...,...,...,...,...,...,...,...,...,...,...,...
995,996,Secret in Their Eyes,"Crime,Drama,Mystery","A tight-knit team of rising investigators, alo...",Billy Ray,"Chiwetel Ejiofor, Nicole Kidman, Julia Roberts...",2015,111,6.2,27585,NaN,45.0
996,997,Hostel: Part II,Horror,Three American college students studying abroa...,Eli Roth,"Lauren German, Heather Matarazzo, Bijou Philli...",2007,94,5.5,73152,17.54,46.0
997,998,Step Up 2: The Streets,"Drama,Music,Romance",Romantic sparks occur between two dance studen...,Jon M. Chu,"Robert Hoffman, Briana Evigan, Cassie Ventura,...",2008,98,6.2,70699,58.01,50.0
998,999,Search Party,"Adventure,Comedy",A pair of friends embark on a mission to reuni...,Scot Armstrong,"Adam Pally, T.J. Miller, Thomas Middleditch,Sh...",2014,93,5.6,4881,NaN,22.0
999,1000,Nine Lives,"Comedy,Family,Fantasy",A stuffy businessman finds himself trapped ins...,Barry Sonnenfeld,"Kevin Spacey, Jennifer Garner, Robbie Amell,Ch...",2016,87,5.3,12435,19.64,11.0

In [133]:
# 5.筛选出评分在其类型平均分上下 0.5 分范围内的电影，展示这些电影的名称和类型。
# 求类型平均分
# d_avg = df.groupby('Genre')['Rating'].mean()
d_avg = df.groupby('Genre')['Rating'].transform('mean')
# df5 = df[abs(df['Rating'] - d_avg) <= 0.5][['Title','Genre']]
# df5
# d_avg
d_avg

0      6.724000
1      6.850000
2      5.643750
3      7.100000
4      6.329630
         ...
995    6.808696
996    5.445455
997    6.200000
998    5.850000
999    5.300000
Name: Rating, Length: 1000, dtype: float64

In [1]:
# groupby 方法的 sort 参数 ，指定是否对分组的字段进行排序，默认是True进行排序
d_avg = df.groupby('Genre')['Rating'].mean()
d_avg

In [12]:
# 6.把电影名称中包含特定关键词（如 “爱情”）的电影数据提取出来，按票房升序排序，保存为新的 CSV 文件。
# contains python的字符串方法，用于判断是否包含参数子字符串
df[df['Title'].str.contains('love')].sort_values(by='Revenue (Millions)')

In [13]:
# 7.计算每部电影的评分与同类型电影评分中位数的差值，筛选出差值绝对值大于 1 的电影。

0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
Name: 班级平均成绩, dtype: float64

In [15]:
# 8.按导演和电影类型分组，找出每个组内评分最高的电影名称、评分以及票房。
g_df['max_value'] = df.groupby(['Director','Genre'])['Rating'].transform('max')
r_max = df[df['Rating'] == g_df['max_value']]
r_max[['Title','Rating','Revenue (Millions)']]

0    85.000000
1    85.000000
2    83.333333
3    83.333333
4    83.333333
Name: 班级平均成绩, dtype: float64

In [36]:
# 9.按电影类型和导演分组，计算每组电影的平均评分、最高票房和电影数量，筛选出电影数量超过 5 部且平均评分高于 7 分的组合。
m_m_c_df = g_df['max_value'] = df.groupby(['Director','Genre']).agg(
    平均评分=('Rating','mean'),
    最高票房=('Revenue (Millions)','max'),
    电影数量=('Title','count')
)
df9 = m_m_c_df[(m_m_c_df['电影数量'] > 2) & (m_m_c_df['平均评分'] > 7)]
df9

                                            平均评分    最高票房  电影数量
Director      Genre
Bryan Singer  Action,Adventure,Sci-Fi   7.066667  233.91     3
David Yates   Adventure,Family,Fantasy  7.550000  301.96     4
James Wan     Horror,Mystery,Thriller   7.233333  137.39     3
Peter Jackson Adventure,Fantasy         7.733333  303.00     3

In [39]:
# 10.按电影类型分组，将每年的电影按评分降序排列，取每年评分最高的前 3 部电影，汇总后计算这些电影的总票房。
# 按电影类型分组
dfg = df.groupby(['Genre','Year'])

In [41]:
# 自定义函数
def get_top_3(group):
    sgr = group.sort_values(by='Rating',ascending=False)
    return sgr.head(3)

dfg_top3 = dfg.apply(get_top_3)
df10 = dfg_top3['Revenue (Millions)'].sum()
df10

C:\Users\LG\AppData\Local\Temp\ipykernel_39000\2771577221.py:6: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  dfg.apply(get_top_3)

                           Rank                   Title             Genre  \
Genre            Year
Action           2016 123   124    Boyka: Undisputed IV            Action
                      580   581    Kickboxer: Vengeance            Action
Action,Adventure 2007 344   345            Spider-Man 3  Action,Adventure
                 2012 368   369  The Amazing Spider-Man  Action,Adventure
                 2014 284   285                Hercules  Action,Adventure
...                         ...                     ...               ...
Thriller         2014 729   730               The Guest          Thriller
                 2016 848   849             Mean Dreams          Thriller
                      933   934                  Detour          Thriller
                      289   290                    Iris          Thriller
Thriller,War     2016 160   161                    Mine      Thriller,War

                                                                 Description  \
Genre            Year
Action           2016 123  In the fourth installment of the fighting fran...
                      580         A kick boxer is out to avenge his brother.
Action,Adventure 2007 344  A strange black entity from another world bond...
                 2012 368  After Peter Parker is bitten by a genetically ...
                 2014 284  Having endured his legendary twelve labors, He...
...                                                                      ...
Thriller         2014 729  A soldier introduces himself to the Peterson f...
                 2016 848  Follows Casey and Jonas, two teenagers despera...
                      933  A young law student blindly enters into a pact...
                      289  Iris, young wife of a businessman, disappears ...
Thriller,War     2016 160  After a failed assassination attempt, a soldie...

                                    Director  \
Genre            Year
Action           2016 123    Todor Chapkanov
                      580     John Stockwell
Action,Adventure 2007 344          Sam Raimi
                 2012 368          Marc Webb
                 2014 284       Brett Ratner
...                                      ...
Thriller         2014 729       Adam Wingard
                 2016 848    Nathan Morlando
                      933  Christopher Smith
                      289      Jalil Lespert
Thriller,War     2016 160    Fabio Guaglione

                                                                      Actors  \
Genre            Year
Action           2016 123  Scott Adkins, Teodora Duhovnikova, Alon Aboutb...
                      580  Dave Bautista, Alain Moussi, Gina Carano, Jean...
Action,Adventure 2007 344  Tobey Maguire, Kirsten Dunst, Topher Grace, Th...
                 2012 368  Andrew Garfield, Emma Stone, Rhys Ifans, Irrfa...
                 2014 284  Dwayne Johnson, John Hurt, Ian McShane, Joseph...
...                                                                      ...
Thriller         2014 729  Dan Stevens, Sheila Kelley, Maika Monroe, Joel...
                 2016 848  Sophie Nélisse, Josh Wiggins, Joe Cobden, Bill...
                      933  Tye Sheridan, Emory Cohen, Bel Powley,Stephen ...
                      289  Romain Duris, Charlotte Le Bon, Jalil Lespert,...
Thriller,War     2016 160  Armie Hammer, Annabelle Wallis,Tom Cullen, Cli...

                           Year  Runtime (Minutes)  Rating   Votes  \
Genre            Year
Action           2016 123  2016                 86     7.4   10428
                      580  2016                 90     4.9    6809
Action,Adventure 2007 344  2007                139     6.2  406219
                 2012 368  2012                136     7.0  474320
                 2014 284  2014                 98     6.0  122838
...                         ...                ...     ...     ...
Thriller         2014 729  2014                100     6.7   71069
                 2016 848  2016                108     6.3    1066
                      933  2016                 97     6.3    2205
                      289  2016                 99     6.1     726
Thriller,War     2016 160  2016                106     6.0    5926

                           Revenue (Millions)  Metascore
Genre            Year
Action           2016 123                 NaN        NaN
                      580              131.56       37.0
Action,Adventure 2007 344              336.53       59.0
                 2012 368              262.03       66.0
                 2014 284               72.66       47.0
...                                       ...        ...
Thriller         2014 729                0.32       76.0
                 2016 848                 NaN       64.0
                      933                 NaN       46.0
                      289                 NaN        NaN
Thriller,War     2016 160                 NaN       40.0

[851 rows x 12 columns]

In [46]:
# 11.按 Director 分组，筛选出平均评分高于 7 分的导演，并列出他们的名字以及平均评分。
m_df = df.groupby('Director')['Rating'].mean()
m_df[m_df>7]

Director
Aamir Khan                     8.500000
Abdellatif Kechiche            7.800000
Aisling Walsh                  7.800000
Alejandro González Iñárritu    7.766667
Alessandro Carloni             7.200000
                                 ...
William Oldroyd                7.300000
Woody Allen                    7.020000
Xavier Dolan                   7.550000
Yorgos Lanthimos               7.200000
Zack Snyder                    7.040000
Name: Rating, Length: 231, dtype: float64

In [ ]:
# 12.按 Director 分组，找出执导电影数量最多的前 5 位导演，并统计他们的电影总票房。
c_s_df = df.groupby('Director').agg(
    电影数量 = ('Title','count'),
    总票房 = ('Revenue (Millions)','sum')
)
df12 = c_s_df.sort_values(by='电影数量',ascending=False).head(5)
df12

In [48]:
# 13.按 Director 分组，统计每位导演拍摄不同类型电影的种类数量
# df.groupby(['Director','Genre']).size()
# df.groupby(['Director','Genre']).count()
df.groupby(['Director','Genre']).agg({
    'Genre':'count'
})

Director             Genre
Aamir Khan           Drama,Family,Music         1
Abdellatif Kechiche  Drama,Romance              1
Adam Leon            Comedy,Romance             1
Adam McKay           Action,Comedy,Crime        1
                     Action,Comedy,Sport        1
                                               ..
Zack Snyder          Action,Adventure,Sci-Fi    1
                     Action,Drama,Mystery       1
                     Action,Fantasy             1
                     Action,Fantasy,War         1
Zackary Adler        Crime,Drama                1
Length: 950, dtype: int64

# 《1960 - 2019 全球 GDP 数据.csv》

In [51]:
df = pd.read_csv("./data/1960-2019全球GDP数据.csv",encoding='gbk')
df

      year   country           GDP
0     1960        美国  543300000000
1     1960        英国   73233967692
2     1960        法国   62225478000
3     1960        中国   59716467625
4     1960        日本   44307342950
...    ...       ...           ...
9925  2019  圣多美和普林西比     418637388
9926  2019        帕劳     268354919
9927  2019      基里巴斯     194647201
9928  2019        瑙鲁     118223430
9929  2019       图瓦卢      47271463

[9930 rows x 3 columns]

In [52]:
# 	1.筛选出 2000 年之后（含 2000 年）的数据，计算这些数据中各国家 GDP 的总和。
df_2000 = df[df['year']>=2000]
# 各国家
df1 = df_2000.groupby('country')['GDP'].sum()
df1

country
不丹           28355412801
东帝汶          56520740800
中国       130918390000000
中非           34498920113
丹麦         5863049000000
              ...
马耳他         179040357018
马达加斯加       190354177644
马里          202326353206
黎巴嫩         706859894360
黑山           70720398983
Name: GDP, Length: 210, dtype: int64

In [56]:
# 	2.按国家分组，过滤出 GDP 数据标准差大于 1000000 的国家，显示这些国家的名称和 GDP 标准差。
df_st = df.groupby('country')['GDP'].std().reset_index()
df2 = df_st[df_st['GDP'] > 1000000]
df2

country
不丹       7.733515e+08
东帝汶      1.833098e+09
中国       3.944559e+12
中非       6.872801e+08
丹麦       1.213597e+11
             ...
马耳他      4.232749e+09
马达加斯加    3.962300e+09
马里       5.067445e+09
黎巴嫩      1.713574e+10
黑山       1.463152e+09
Name: GDP, Length: 210, dtype: float64

In [57]:
# 	3.找出每年 GDP 最高的国家及其对应的 GDP 值，将结果保存为新的 DataFrame。
# 法一
df.sort_values(by=['year','GDP'],ascending=[True,False]).groupby('year').head(1)
# 法二
df3 = df.groupby('year').agg({
    'GDP': 'max'
})
df3_1 = pd.merge(df3, df, on=['year', 'GDP'])

      year country             GDP
0     1960      美国    543300000000
103   1961      美国    563300000000
206   1962      美国    605100000000
311   1963      美国    638600000000
416   1964      美国    685800000000
521   1965      美国    743700000000
635   1966      美国    815000000000
750   1967      美国    861700000000
868   1968      美国    942500000000
988   1969      美国   1019900000000
1108  1970      美国   1073300000000
1237  1971      美国   1164850000000
1367  1972      美国   1279110000000
1497  1973      美国   1425380000000
1627  1974      美国   1545240000000
1758  1975      美国   1684900000000
1891  1976      美国   1873410000000
2025  1977      美国   2081830000000
2163  1978      美国   2351600000000
2300  1979      美国   2627330000000
2438  1980      美国   2857310000000
2586  1981      美国   3207040000000
2737  1982      美国   3343790000000
2889  1983      美国   3634040000000
3042  1984      美国   4037610000000
3196  1985      美国   4338980000000
3352  1986      美国   4579630000000
3510  1987      美国   4855220000000
3672  1988      美国   5236440000000
3837  1989      美国   5641580000000
4002  1990      美国   5963140000000
4185  1991      美国   6158130000000
4366  1992      美国   6520330000000
4548  1993      美国   6858560000000
4733  1994      美国   7287240000000
4920  1995      美国   7639750000000
5112  1996      美国   8073120000000
5305  1997      美国   8577550000000
5497  1998      美国   9062820000000
5690  1999      美国   9630660000000
5884  2000      美国  10252300000000
6081  2001      美国  10581800000000
6279  2002      美国  10936400000000
6480  2003      美国  11458200000000
6681  2004      美国  12213700000000
6883  2005      美国  13036600000000
7086  2006      美国  13814600000000
7289  2007      美国  14451900000000
7493  2008      美国  14712800000000
7697  2009      美国  14448900000000
7901  2010      美国  14992100000000
8105  2011      美国  15542600000000
8311  2012      美国  16197000000000
8516  2013      美国  16784800000000
8722  2014      美国  17527200000000
8928  2015      美国  18224700000000
9133  2016      美国  18715000000000
9338  2017      美国  19519400000000
9542  2018      美国  20580200000000
9745  2019      美国  21433200000000

In [58]:
# 	4.计算每个国家 GDP 占全球 GDP 总和的比例，按年份分组，找出每年占比最高的前三个国家。
def year_max_3(datas):
    g_gdp = datas['GDP'].sum()
    datas['gdp_ratio'] = datas['GDP'] / g_gdp
    return datas.sort_values(by='gdp_ratio',ascending=False).head(3)

df4 = df.groupby('year').apply(year_max_3)
df4

C:\Users\LG\AppData\Local\Temp\ipykernel_39000\2258044707.py:7: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  df4 = df.groupby('year').apply(year_max_3)

           year country             GDP  gdp_ratio
year
1960 0     1960      美国    543300000000   0.468481
     1     1960      英国     73233967692   0.063149
     2     1960      法国     62225478000   0.053656
1961 103   1961      美国    563300000000   0.466662
     104   1961      英国     77741965703   0.064405
...         ...     ...             ...        ...
2018 9543  2018      中国  13894800000000   0.163241
     9544  2018      日本   4954810000000   0.058211
2019 9745  2019      美国  21433200000000   0.249976
     9746  2019      中国  14279900000000   0.166547
     9747  2019      日本   5081770000000   0.059269

[180 rows x 4 columns]

In [59]:
# 	5.把国家名称中包含特定字符（如 “国”）的国家数据提取出来，按 GDP 降序排序，保存为新的 CSV 文件。
df_c = df[df['country'].str.contains('国')]
df_c.sort_values(by='GDP',ascending=False)

      year country             GDP
9745  2019      美国  21433200000000
9542  2018      美国  20580200000000
9338  2017      美国  19519400000000
9133  2016      美国  18715000000000
8928  2015      美国  18224700000000
...    ...     ...             ...
561   1965      韩国      3120833333
138   1961      泰国      3034043574
243   1962      韩国      2814318516
35    1960      泰国      2760747471
141   1961      韩国      2417558289

[410 rows x 3 columns]

# 《uniqlo.csv》

In [60]:
# 1.读取文件，筛选出价格在 50 - 100 元之间且销量大于 100 的商品，按销量降序排序后保存为新的 CSV 文件。
df = pd.read_csv('./data/uniqlo.csv')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22293 entries, 0 to 22292
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   store_id      22293 non-null  int64
 1   city          22293 non-null  object
 2   channel       22293 non-null  object
 3   gender_group  22293 non-null  object
 4   age_group     22293 non-null  object
 5   wkd_ind       22293 non-null  object
 6   product       22293 non-null  object
 7   customer      22293 non-null  int64
 8   revenue       22293 non-null  float64
 9   order         22293 non-null  int64
 10  quant         22293 non-null  int64
 11  unit_cost     22293 non-null  int64
dtypes: float64(1), int64(5), object(6)
memory usage: 2.0+ MB

In [62]:
# 筛选出价格在 50 - 100 元之间且销量大于 100 的商品，按销量降序排序
df1 = df[(df['unit_cost'] >= 50) & (df['unit_cost'] <=100) & (df['quant'] > 50)].sort_values(by='quant',ascending=False)
df1

,store_id,city,channel,gender_group,age_group,wkd_ind,product,customer,revenue,order,quant,unit_cost
9628,19,南京,线下,Female,45-49,Weekday,当季新品,42,12538.00,45,70,59
9699,437,重庆,线下,Female,35-39,Weekday,当季新品,58,10498.28,65,65,59
16309,146,杭州,线下,Female,25-29,Weekday,当季新品,45,8836.00,54,55,59

In [109]:
# 2.按商品类别分组，过滤出平均价格低于 30 元的类别，展示这些类别的名称和平均价格。
d_m = df.groupby('product')['unit_cost'].mean().reset_index(name='平均价格')
# df.reset_index()
# s1 = pd.Series([1,2,3,4,5])
# s1.reset_index()
# df.groupby('product')['unit_cost'].mean()[8]
# df.groupby('product')['unit_cost'].mean()
# type(df.groupby('product')['unit_cost'].mean()[0])
d_m
# d_m[d_m['平均价格'] < 30]
# df1 = df.groupby('product')['unit_cost']
# df1.mean()
# df.groupby('product')['unit_cost'].groups["毛衣"]

  product  平均价格
0      T恤  49.0
1    当季新品  59.0
2      毛衣  99.0
3     牛仔裤  69.0
4      短裤  19.0
5      袜子   9.0
6      裙子  59.0
7      运动  49.0
8      配件  29.0

In [114]:
d_m.groupby("平均价格")['product'].min().reset_index(name='品牌')

   平均价格    品牌
0   9.0    袜子
1  19.0    短裤
2  29.0    配件
3  49.0    T恤
4  59.0  当季新品
5  69.0   牛仔裤
6  99.0    毛衣

In [116]:
d_m.reset_index(names='123')

   123 product  平均价格
0    0      T恤  49.0
1    1    当季新品  59.0
2    2      毛衣  99.0
3    3     牛仔裤  69.0
4    4      短裤  19.0
5    5      袜子   9.0
6    6      裙子  59.0
7    7      运动  49.0
8    8      配件  29.0

In [4]:
# 3.找出每月销售额最高的商品及其销售额，将结果保存为新的 DataFrame。(去掉，无该字段数据)

In [67]:
# 4.读取文件后，去除销量为 0 的商品记录，然后计算剩余商品的总销售额。
df[df['quant'] != 0]['revenue'].sum()

3556432.8499999996

In [4]:
# 5.计算每件商品的价格与同类别商品价格均值的差值，筛选出差值绝对值大于 50 的商品。(去掉)